/* 
======================================================================
ВОПРОС 1: Какова общая картина бизнеса (динамика заказов)?
======================================================================
ЧТО ПОКАЗАЛ ЗАПРОС:
Этот запрос считает общее количество успешных и активных заказов, а именно <<98 207>> на 
маркетплейсе, полностью исключая отмененные и недоступные сделки

ВЫВОД / ИНСАЙТ:
Мы получили базовую очищенную метрику объема продаж. Данное число 
стоит использовать как генеральную совокупность для расчета конверсий.
======================================================================
*/

SELECT COUNT(*) 
FROM olist_orders_dataset
WHERE order_status NOT IN ('canceled', 'unavailable');

/* 
======================================================================
ВОПРОС 2: [Сколько уникальных клиентов]
======================================================================
ЧТО ПОКАЗАЛ ЗАПРОС:
<< 96 096 >>
ВЫВОД: Количество заказов от уникальных клиентов довольно большое что выводит на два выводы...

*/
SELECT COUNT(DISTINCT customer_unique)
from olist_customers_dataset
/* 
======================================================================
ВОПРОС 2: [Какие способы оплаты используются и какой самый популярный ?]
======================================================================
ЧТО ПОКАЗАЛ ЗАПРОС:
*/"payment_type":"COUNT(*)"
"boleto":"19784"
"credit_card":"76795"
"debit_card":"1529"
"not_defined":"3"
"voucher":"5775"
/*
ВЫВОД / ИНСАЙТ:
  1. Доминирование кредитных карт (более 73% всех оплат) говорит о том, 
   что клиенты Olist активно используют рассрочки (в Бразилии покупка в 
   рассрочку по кредитке — национальный стандарт потребления).
2. Популярность Boleto (около 19%) подтверждает, что значительная часть 
   населения всё еще предпочитает оплату наличными через банк или у них 
   нет доступа к кредитным лимитам. Для бизнеса критично сохранять этот 
   способ оплаты, чтобы не терять пятую часть клиентов.
3. Статус 'not_defined' (всего 3 случая) — это аномалия или технический сбой, 
   которым можно пренебречь при общем анализе данных.
  
  */
SELECT payment_type,
       COUNT(*)
FROM olist_order_payments_dataset
GROUP BY payment_type;
/* 
======================================================================
ВОПРОС 3:Какой общий объём платежей(GMV)?
======================================================================
ЗАПРОС:
*/
SELECT SUM(payment_value) AS GMV
FROM olist_order_payments_dataset

/*
ЧТО ПОКАЗАЛ ЗАПРОС:
*/
  "GMV":"16 008 872.12"
/*
  ВЫВОД / ИНСАЙТ:
Эта цифра отражает "грязный" оборот маркетплейса (со всеми отменами).
Чтобы бизнес видел реальную картину, для финмодели нужно считать 
"чистый" GMV — только по активным и доставленным заказам. 
Если отфильтровать отмененные (canceled) и недоступные (unavailable) 
заказы, мы получим реальную выручку компании без учета возвратов.
======================================================================

======================================================================
ВОПРОС 3: Какова общая картина бизнеса (динамика заказов)?
======================================================================
ЧТО ПОКАЗАЛ ЗАПРОС:

ВЫВОД / ИНСАЙТ:
======================================================================
ВОПРОС 3: Какова общая картина бизнеса (динамика заказов)?
======================================================================
ЧТО ПОКАЗАЛ ЗАПРОС:

ВЫВОД / ИНСАЙТ:
======================================================================
ВОПРОС 3: Какова общая картина бизнеса (динамика заказов)?
======================================================================
ЧТО ПОКАЗАЛ ЗАПРОС:

ВЫВОД / ИНСАЙТ:
======================================================================
ВОПРОС 3: Какова общая картина бизнеса (динамика заказов)?
======================================================================
ЧТО ПОКАЗАЛ ЗАПРОС:

ВЫВОД / ИНСАЙТ:
======================================================================
ВОПРОС 3: Какова общая картина бизнеса (динамика заказов)?
======================================================================
ЧТО ПОКАЗАЛ ЗАПРОС:

ВЫВОД / ИНСАЙТ:
======================================================================
ВОПРОС 3: Какова общая картина бизнеса (динамика заказов)?
======================================================================
ЧТО ПОКАЗАЛ ЗАПРОС:

ВЫВОД / ИНСАЙТ:
======================================================================

